STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U575I-EV/stm32u575i_eval_audio.c
   + For each mode, you may need to implement the relative callback functions into your code.
      The Callback functions are named AUDIO_IN_XXX_CallBack() and only their prototypes are declared in
      the stm32u575i_eval_audio.h file (refer to the example for more details on the callbacks implementations).

   + The driver API and the callback functions are at the end of the stm32u575i_eval_audio.h file.

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32u575i_eval_audio.h"
#include "stm32u575i_eval_bus.h"
#if (USE_BSP_IO_CLASS > 0)
#include "stm32u575i_eval_io.h"
#endif /* USE_BSP_IO_CLASS */

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32U575I_EVAL
  * @{
  */

/** @defgroup STM32U575I_EVAL_AUDIO AUDIO
  * @{
  */

/** @defgroup STM32U575I_EVAL_AUDIO_Private_Macros AUDIO Private Macros
  * @{
  */
#define MDF_DECIMATION_RATIO(__FREQUENCY__) \
  ((__FREQUENCY__) == (AUDIO_FREQUENCY_8K))  ? (352U) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_11K)) ? (256U) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_16K)) ? (176U) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_22K)) ? (64U) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_32K)) ? (88U) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_44K)) ? (64U) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_48K)) ? (44U) : (128U)

/**
  * @}
  */

/** @defgroup STM32U575I_EVAL_AUDIO_Exported_Variables AUDIO Exported Variables
  * @{
  */
/* Audio in and out context */
AUDIO_OUT_Ctx_t Audio_Out_Ctx[AUDIO_OUT_INSTANCES_NBR] = {{
    AUDIO_OUT_HEADPHONE,
    AUDIO_FREQUENCY_11K,
    AUDIO_RESOLUTION_16B,
    50U,
    1U,
    AUDIO_MUTE_DISABLED,
    AUDIO_OUT_STATE_RESET
  }
};

AUDIO_IN_Ctx_t  Audio_In_Ctx[AUDIO_IN_INSTANCES_NBR] = {{
    AUDIO_IN_DEVICE_ANALOG_MIC,
    AUDIO_FREQUENCY_8K,
    AUDIO_RESOLUTION_16B,
    1U,
    NULL,
    0U,
    50U,
    AUDIO_IN_STATE_RESET
  },
  {
    AUDIO_IN_DEVICE_DIGITAL_MIC,
    AUDIO_FREQUENCY_11K,
    AUDIO_RESOLUTION_16B,
    1U,
    NULL,
    0U,
    50U,
    AUDIO_IN_STATE_RESET
  }
};

/* Audio component object */
void *Audio_CompObj = NULL;

/* Audio driver */
AUDIO_Drv_t *Audio_Drv = NULL;

/* Audio in and out SAI handles */
SAI_HandleTypeDef haudio_out_sai = {0};
SAI_HandleTypeDef haudio_in_sai  = {0};

/* Audio in MDF handles */
MDF_HandleTypeDef   haudio_in_mdf_filter = {0};

/**
  * @}
  */

/** @defgroup STM32U575I_EVAL_AUDIO_Private_Variables AUDIO Private Variables
  * @{
  */
/* Audio in and out DMA handles used by SAI */
DMA_HandleTypeDef hDmaSaiTx, hDmaSaiRx;

/* Audio in DMA handle used by MDF */
DMA_HandleTypeDef   haudio_mdf;

/* Queue variables declaration */
static DMA_QListTypeDef SAITxQueue, SAIRxQueue, MdfQueue;

/* Audio in MDF global variables */
static uint32_t Audio_DmaDigMicRecHalfBuffCplt;
static uint32_t Audio_DmaDigMicRecBuffCplt;
static MDF_FilterConfigTypeDef filterConfig;
static MDF_DmaConfigTypeDef    dmaConfig;

#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)
static uint32_t AudioOut_IsMspCbValid[AUDIO_OUT_INSTANCES_NBR] = {0};
#endif /* USE_HAL_SAI_REGISTER_CALLBACKS */
#if ((USE_HAL_MDF_REGISTER_CALLBACKS == 1) || (USE_HAL_SAI_REGISTER_CALLBACKS == 1))
static uint32_t AudioIn_IsMspCbValid[AUDIO_IN_INSTANCES_NBR] = {0};
#endif /* (USE_HAL_MDF_REGISTER_CALLBACKS == 1) || (USE_HAL_SAI_REGISTER_CALLBACKS == 1) */
/**
  * @}
  */

/** @defgroup STM32U575I_EVAL_AUDIO_Private_Function_Prototypes AUDIO Private Function Prototypes
  * @{
  */
static int32_t CS42L51_Probe(void);
static int32_t CS42L51_PowerUp(void);
static int32_t CS42L51_PowerDown(void);
static void    SAI_MspInit(SAI_HandleTypeDef *hsai);
static void    SAI_MspDeInit(const SAI_HandleTypeDef *hsai);
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)
static void    SAI_TxCpltCallback(SAI_HandleTypeDef *hsai);
static void    SAI_TxHalfCpltCallback(SAI_HandleTypeDef *hsai);
static void    SAI_RxCpltCallback(SAI_HandleTypeDef *hsai);
static void    SAI_RxHalfCpltCallback(SAI_HandleTypeDef *hsai);
static void    SAI_ErrorCallback(SAI_HandleTypeDef *hsai);
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1) */

static void    MDF_BlockMspInit(MDF_HandleTypeDef *hmdf);
static void    MDF_BlockMspDeInit(const MDF_HandleTypeDef *hmdf);
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
static void    MDF_AcquisitionCpltCallback(MDF_HandleTypeDef *hadf_filter);
static void    MDF_AcquisitionHalfCpltCallback(MDF_HandleTypeDef *hadf_filter);
static void    MDF_ErrorCallback(MDF_HandleTypeDef *hadf_filter);
#endif /* (USE_HAL_MDF_REGISTER_CALLBACKS == 1) */
/**
  * @}
  */

/** @addtogroup STM32U575I_EVAL_AUDIO_OUT_Exported_Functions
  * @{
  */
/**
  * @brief  Initialize the audio out peripherals.
  * @param  Instance Audio out instance.
  * @param  AudioInit Audio out init structure.
  * @retval BSP status.
  */
int32_t BSP_AUDIO_OUT_Init(uint32_t Instance, BSP_AUDIO_Init_t *AudioInit)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= AUDIO_OUT_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else if ((Instance == 0U) && ((AudioInit->BitsPerSample == AUDIO_RESOLUTION_32B)
                                || (AudioInit->BitsPerSample == AUDIO_RESOLUTION_8B)))
  {
    status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else if ((Instance == 0U) && (Audio_In_Ctx[0].State != AUDIO_IN_STATE_RESET) &&
           ((Audio_In_Ctx[0].SampleRate != AudioInit->SampleRate) ||
            (Audio_In_Ctx[0].BitsPerSample != AudioInit->BitsPerSample)))
  {
    status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else if (Audio_Out_Ctx[Instance].State != AUDIO_OUT_STATE_RESET)
  {
    status = BSP_ERROR_BUSY;
  }
  else
  {
    /* Un-reset audio codec if not currently used by audio in instance 0 */
    if (Audio_In_Ctx[0].State == AUDIO_IN_STATE_RESET)
    {
      if (CS42L51_PowerUp() != BSP_ERROR_NONE)
      {
        status = BSP_ERROR_COMPONENT_FAILURE;
      }
    }

    if (status == BSP_ERROR_NONE)
    {
      /* Fill audio out context structure */
      Audio_Out_Ctx[Instance].Device         = AudioInit->Device;
      Audio_Out_Ctx[Instance].SampleRate     = AudioInit->SampleRate;
      Audio_Out_Ctx[Instance].BitsPerSample  = AudioInit->BitsPerSample;
      Audio_Out_Ctx[Instance].ChannelsNbr    = AudioInit->ChannelsNbr;
      Audio_Out_Ctx[Instance].Volume         = AudioInit->Volume;

