STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U575I-EV/stm32u575i_eval_audio.c
      /* Probe the audio codec */
      if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
      {
        if (CS42L51_Probe() != BSP_ERROR_NONE)
        {
          status = BSP_ERROR_COMPONENT_FAILURE;
        }
      }

      if (status == BSP_ERROR_NONE)
      {
        /* Set SAI instance */
        haudio_out_sai.Instance = SAI1_Block_B;

        /* Configure the SAI PLL according to the requested audio frequency if not already done by other instances */
        if (Audio_In_Ctx[0].State == AUDIO_IN_STATE_RESET)
        {
          if (MX_SAI1_ClockConfig(&haudio_out_sai, AudioInit->SampleRate) != HAL_OK)
          {
            status = BSP_ERROR_CLOCK_FAILURE;
          }
        }

        if (status == BSP_ERROR_NONE)
        {
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 0)
          SAI_MspInit(&haudio_out_sai);
#else
          /* Register the SAI MSP Callbacks */
          if (AudioOut_IsMspCbValid[Instance] == 0U)
          {
            if (BSP_AUDIO_OUT_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
            {
              status = BSP_ERROR_PERIPH_FAILURE;
            }
          }
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 0) */
        }

        if (status == BSP_ERROR_NONE)
        {
          /* Prepare SAI peripheral initialization */
          MX_SAI_InitTypeDef mxSaiInit;
          mxSaiInit.AudioFrequency    = AudioInit->SampleRate;
          mxSaiInit.AudioMode         = SAI_MODEMASTER_TX;
          mxSaiInit.ClockStrobing     = SAI_CLOCKSTROBING_FALLINGEDGE;
          mxSaiInit.MonoStereoMode    = (AudioInit->ChannelsNbr == 1U) ? SAI_MONOMODE : SAI_STEREOMODE;
          if (AudioInit->BitsPerSample == AUDIO_RESOLUTION_24B)
          {
            mxSaiInit.DataSize          = SAI_DATASIZE_24;
            mxSaiInit.FrameLength       = 64;
            mxSaiInit.ActiveFrameLength = 32;
          }
          else
          {
            mxSaiInit.DataSize          = SAI_DATASIZE_16;
            mxSaiInit.FrameLength       = 32;
            mxSaiInit.ActiveFrameLength = 16;
          }
          mxSaiInit.OutputDrive       = SAI_OUTPUTDRIVE_ENABLE;
          mxSaiInit.Synchro           = SAI_ASYNCHRONOUS;
          mxSaiInit.SynchroExt        = SAI_SYNCEXT_DISABLE;
          mxSaiInit.SlotActive        = SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1;

          /* SAI peripheral initialization */
          if (MX_SAI1_Init(&haudio_out_sai, &mxSaiInit) != HAL_OK)
          {
            status = BSP_ERROR_PERIPH_FAILURE;
          }
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)
          /* Register SAI TC, HT and Error callbacks */
          else if (HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_TX_COMPLETE_CB_ID, SAI_TxCpltCallback) != HAL_OK)
          {
            status = BSP_ERROR_PERIPH_FAILURE;
          }
          else if (HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_TX_HALFCOMPLETE_CB_ID, SAI_TxHalfCpltCallback)
                   != HAL_OK)
          {
            status = BSP_ERROR_PERIPH_FAILURE;
          }
          else if (HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_ERROR_CB_ID, SAI_ErrorCallback) != HAL_OK)
          {
            status = BSP_ERROR_PERIPH_FAILURE;
          }
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1) */
          else
          {
            /* Initialize audio codec */
            CS42L51_Init_t codec_init;
            codec_init.InputDevice  = (Audio_In_Ctx[0].State == AUDIO_IN_STATE_RESET)
                                      ? CS42L51_IN_NONE
                                      : CS42L51_IN_MIC1;
            codec_init.OutputDevice = CS42L51_OUT_HEADPHONE;
            codec_init.Frequency    = AudioInit->SampleRate;
            codec_init.Resolution   = CS42L51_RESOLUTION_16B; /* Not used */
            codec_init.Volume       = AudioInit->Volume;
            if (Audio_Drv->Init(Audio_CompObj, &codec_init) < 0)
            {
              status = BSP_ERROR_COMPONENT_FAILURE;
            }
            else
            {
              /* Update audio out context state */
              Audio_Out_Ctx[Instance].State = AUDIO_OUT_STATE_STOP;
            }
          }
        }
      }
    }
  }
  return status;
}

/**
  * @brief  De-initialize the audio out peripherals.
  * @param  Instance Audio out instance.
  * @retval BSP status.
  */
int32_t BSP_AUDIO_OUT_DeInit(uint32_t Instance)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= AUDIO_OUT_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else if (Audio_Out_Ctx[Instance].State != AUDIO_OUT_STATE_RESET)
  {
    /* Reset audio codec if not currently used by audio in instance 0 */
    if (Audio_In_Ctx[0].State == AUDIO_IN_STATE_RESET)
    {
      if (CS42L51_PowerDown() != BSP_ERROR_NONE)
      {
        status = BSP_ERROR_COMPONENT_FAILURE;
      }
    }

    if (status == BSP_ERROR_NONE)
    {
      /* SAI peripheral de-initialization */
      if (HAL_SAI_DeInit(&haudio_out_sai) != HAL_OK)
      {
        status = BSP_ERROR_PERIPH_FAILURE;
      }
      /* De-initialize audio codec if not currently used by audio in instance 0 */
      else
      {
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 0)
        SAI_MspDeInit(&haudio_out_sai);
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 0) */
        if (Audio_In_Ctx[0].State == AUDIO_IN_STATE_RESET)
        {
          if (Audio_Drv->DeInit(Audio_CompObj) < 0)
          {
            status = BSP_ERROR_COMPONENT_FAILURE;
          }
        }
      }

      if (status == BSP_ERROR_NONE)
      {
        /* Update audio out context */
        Audio_Out_Ctx[Instance].State  = AUDIO_OUT_STATE_RESET;
        Audio_Out_Ctx[Instance].IsMute = 0U;
      }
    }
  }
  else
  {
    /* Nothing to do */
  }
  return status;
}

/**
  * @brief  Start playing audio stream from a data buffer for a determined size.
  * @param  Instance Audio out instance.
  * @param  pData Pointer on data buffer.
  * @param  NbrOfBytes Size of buffer in bytes. Maximum size is 65535 bytes.
  * @retval BSP status.
  */
int32_t BSP_AUDIO_OUT_Play(uint32_t Instance, uint8_t *pData, uint32_t NbrOfBytes)
{
  int32_t  status = BSP_ERROR_NONE;
  uint16_t NbrOfDmaDatas;

  if ((Instance >= AUDIO_OUT_INSTANCES_NBR) || (pData == NULL)/* || (NbrOfBytes > 65535U)*/)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  /* Check audio out state */
  else if (Audio_Out_Ctx[Instance].State != AUDIO_OUT_STATE_STOP)
  {
    status = BSP_ERROR_BUSY;
  }
  else
  {
    /* Compute number of DMA data to tranfser according resolution */
    if (Audio_Out_Ctx[Instance].BitsPerSample == AUDIO_RESOLUTION_16B)
    {
      NbrOfDmaDatas = (uint16_t)(NbrOfBytes / 2U);
    }
    else /* AUDIO_RESOLUTION_24b */
    {
      NbrOfDmaDatas = (uint16_t)(NbrOfBytes / 4U);
    }
    /* Initiate a DMA transfer of audio samples towards the serial audio interface */
    if (HAL_SAI_Transmit_DMA(&haudio_out_sai, pData, NbrOfDmaDatas) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    /* Call the audio codec play function */
    else if (Audio_Drv->Play(Audio_CompObj) < 0)
    {
      status = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      /* Update audio out state */
      Audio_Out_Ctx[Instance].State = AUDIO_OUT_STATE_PLAYING;
    }
  }
  return status;
}

/**
  * @brief  Pause playback of audio stream.
  * @param  Instance Audio out instance.
  * @retval BSP status.
  */
int32_t BSP_AUDIO_OUT_Pause(uint32_t Instance)
{
  int32_t status = BSP_ERROR_NONE;

