STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U575I-EV/stm32u575i_eval_audio.c
    /*****************************/
    /* SAI block used for record */
    /*****************************/
    /* Configure SAI_Block_A used for receive */
    hsai->Init.AudioMode      = SAI_MODESLAVE_RX;
    hsai->Init.Synchro        = SAI_SYNCHRONOUS;
    hsai->Init.SynchroExt     = SAI_SYNCEXT_DISABLE;
    hsai->Init.OutputDrive    = SAI_OUTPUTDRIVE_ENABLE;
    hsai->Init.NoDivider      = SAI_MASTERDIVIDER_ENABLE;
    hsai->Init.FIFOThreshold  = SAI_FIFOTHRESHOLD_1QF;
    hsai->Init.AudioFrequency = SAI_AUDIO_FREQUENCY_MCKDIV;
    hsai->Init.Mckdiv         = 0U;
    hsai->Init.MonoStereoMode = SAI_MONOMODE;
    hsai->Init.CompandingMode = SAI_NOCOMPANDING;
    hsai->Init.TriState       = SAI_OUTPUT_NOTRELEASED;
    hsai->Init.Protocol       = SAI_FREE_PROTOCOL;
    hsai->Init.DataSize       = MXInit->DataSize;
    hsai->Init.FirstBit       = SAI_FIRSTBIT_MSB;
    hsai->Init.ClockStrobing  = SAI_CLOCKSTROBING_FALLINGEDGE;

    /* Configure SAI_Block_A Frame
    Frame Length: 64 or 32
    Frame active Length: 32 or 16
    FS Definition: Start frame + Channel Side identification
    FS Polarity: FS active Low
    FS Offset: FS asserted one bit before the first bit of slot 0 */
    hsai->FrameInit.FrameLength = MXInit->FrameLength;
    hsai->FrameInit.ActiveFrameLength = MXInit->ActiveFrameLength;
    hsai->FrameInit.FSDefinition = SAI_FS_CHANNEL_IDENTIFICATION;
    hsai->FrameInit.FSPolarity = SAI_FS_ACTIVE_LOW;
    hsai->FrameInit.FSOffset = SAI_FS_BEFOREFIRSTBIT;

    /* Configure SAI Block_A Slot
    Slot First Bit Offset: 0
    Slot Size  : 16
    Slot Number: 2
    Slot Active: Slots 0 and 1 actives */
    hsai->SlotInit.FirstBitOffset = 0;
    hsai->SlotInit.SlotSize = SAI_SLOTSIZE_DATASIZE;
    hsai->SlotInit.SlotNumber = 2;
    hsai->SlotInit.SlotActive = SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1;

    /**********************************/
    /* Initializes the SAI peripheral */
    /**********************************/
    if (HAL_SAI_Init(hsai) != HAL_OK)
    {
      status = HAL_ERROR;
    }
  }
  return status;
}
/**
  * @}
  */

/** @addtogroup STM32U575I_EVAL_AUDIO_IN_Exported_Functions
  * @{
  */
/**
  * @brief  Initialize the audio in peripherals.
  * @param  Instance Audio in instance.
  * @param  AudioInit Audio in init structure.
  * @retval BSP status.
  */
int32_t BSP_AUDIO_IN_Init(uint32_t Instance, BSP_AUDIO_Init_t *AudioInit)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= AUDIO_IN_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else if (Audio_In_Ctx[Instance].State != AUDIO_IN_STATE_RESET)
  {
    status = BSP_ERROR_BUSY;
  }
  else if ((Instance == 0U) && (AudioInit->ChannelsNbr != 1U))
  {
    status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else if ((Audio_Out_Ctx[0].State != AUDIO_OUT_STATE_RESET) && (Audio_Out_Ctx[0].SampleRate != AudioInit->SampleRate))
  {
    status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else if ((Instance == 0U) && (Audio_In_Ctx[0].State != AUDIO_IN_STATE_RESET)
           && (Audio_In_Ctx[0].SampleRate != AudioInit->SampleRate))
  {
    status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else if ((Instance == 0U) && (Audio_Out_Ctx[0].State != AUDIO_OUT_STATE_RESET) &&
           (Audio_Out_Ctx[0].BitsPerSample != AudioInit->BitsPerSample))
  {
    status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else
  {
    if (Instance == 0U)
    {
      /* Un-reset audio codec if not currently used by audio out instance 0 */
      if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
      {
        if (CS42L51_PowerUp() != BSP_ERROR_NONE)
        {
          status = BSP_ERROR_COMPONENT_FAILURE;
        }
      }

      if (status == BSP_ERROR_NONE)
      {
        /* Fill audio in context structure */
        Audio_In_Ctx[Instance].Device         = AudioInit->Device;
        Audio_In_Ctx[Instance].SampleRate     = AudioInit->SampleRate;
        Audio_In_Ctx[Instance].BitsPerSample  = AudioInit->BitsPerSample;
        Audio_In_Ctx[Instance].ChannelsNbr    = AudioInit->ChannelsNbr;
        Audio_In_Ctx[Instance].Volume         = AudioInit->Volume;

        /* Probe the audio codec */
        if (Audio_In_Ctx[0].State == AUDIO_IN_STATE_RESET)
        {
          if (CS42L51_Probe() != BSP_ERROR_NONE)
          {
            status = BSP_ERROR_COMPONENT_FAILURE;
          }
        }

        if (status == BSP_ERROR_NONE)
        {
          /* Set SAI instances (SAI1_Block_B needed for MCLK, FS and CLK signals) */
          haudio_in_sai.Instance  = SAI1_Block_A;
          haudio_out_sai.Instance = SAI1_Block_B;

          /* Configure the SAI PLL according to the requested audio frequency if not already done by other instances */
          if ((Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET) && (Audio_In_Ctx[0].State == AUDIO_IN_STATE_RESET))
          {
            if (MX_SAI1_ClockConfig(&haudio_in_sai, AudioInit->SampleRate) != HAL_OK)
            {
              status = BSP_ERROR_CLOCK_FAILURE;
            }
          }

          if (status == BSP_ERROR_NONE)
          {
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 0)
            SAI_MspInit(&haudio_in_sai);
            if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
            {
              SAI_MspInit(&haudio_out_sai);
            }
#else
            /* Register the SAI MSP Callbacks */
            if (AudioIn_IsMspCbValid[Instance] == 0U)
            {
              if (BSP_AUDIO_IN_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
              {
                status = BSP_ERROR_PERIPH_FAILURE;
              }
            }
            if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
            {
              if (AudioOut_IsMspCbValid[0] == 0U)
              {
                if (BSP_AUDIO_OUT_RegisterDefaultMspCallbacks(0) != BSP_ERROR_NONE)
                {
                  status = BSP_ERROR_PERIPH_FAILURE;
                }
              }
            }
#endif /* #if (USE_HAL_SAI_REGISTER_CALLBACKS == 0) */
          }

          if (status == BSP_ERROR_NONE)
          {
            /* Prepare SAI peripheral initialization */
            MX_SAI_InitTypeDef mxSaiInit;
            mxSaiInit.AudioFrequency    = AudioInit->SampleRate;
            mxSaiInit.AudioMode         = SAI_MODESLAVE_RX;
            mxSaiInit.ClockStrobing     = SAI_CLOCKSTROBING_FALLINGEDGE;
            mxSaiInit.MonoStereoMode    = SAI_MONOMODE;
            if (AudioInit->BitsPerSample == AUDIO_RESOLUTION_24B)
            {
              mxSaiInit.DataSize          = SAI_DATASIZE_24;
              mxSaiInit.FrameLength       = 64;
              mxSaiInit.ActiveFrameLength = 32;
            }
            else
            {
              mxSaiInit.DataSize          = SAI_DATASIZE_16;
              mxSaiInit.FrameLength       = 32;
              mxSaiInit.ActiveFrameLength = 16;
            }
            mxSaiInit.OutputDrive       = SAI_OUTPUTDRIVE_ENABLE;
            mxSaiInit.Synchro           = SAI_SYNCHRONOUS;
            mxSaiInit.SynchroExt        = SAI_SYNCEXT_DISABLE;
            mxSaiInit.SlotActive        = SAI_SLOTACTIVE_0;

            /* SAI peripheral initialization */
            if (MX_SAI1_Init(&haudio_in_sai, &mxSaiInit) != HAL_OK)
            {
              status = BSP_ERROR_PERIPH_FAILURE;
            }
            else
            {
              if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
              {
                /* Initialize SAI peripheral used to generate clock and synchro */
                mxSaiInit.AudioMode  = SAI_MODEMASTER_TX;
                mxSaiInit.Synchro    = SAI_ASYNCHRONOUS;
                mxSaiInit.SlotActive = SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1;
                if (MX_SAI1_Init(&haudio_out_sai, &mxSaiInit) != HAL_OK)
                {
                  status = BSP_ERROR_PERIPH_FAILURE;
                }
              }
            }
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)
            if (status == BSP_ERROR_NONE)
            {
              /* Register SAI TC, HT and Error callbacks */
              if (HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_RX_COMPLETE_CB_ID, SAI_RxCpltCallback) != HAL_OK)
              {
                status = BSP_ERROR_PERIPH_FAILURE;
              }
              else if (HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_RX_HALFCOMPLETE_CB_ID, SAI_RxHalfCpltCallback)
                       != HAL_OK)
              {
                status = BSP_ERROR_PERIPH_FAILURE;
              }
              else
              {
                if (HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_ERROR_CB_ID, SAI_ErrorCallback) != HAL_OK)
                {
                  status = BSP_ERROR_PERIPH_FAILURE;
                }
              }
            }
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1) */
            if (status == BSP_ERROR_NONE)
            {
              /* Initialize audio codec */
              CS42L51_Init_t codec_init;
              codec_init.InputDevice  = CS42L51_IN_MIC1;
              codec_init.OutputDevice = (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
                                        ? CS42L51_OUT_NONE
                                        : CS42L51_OUT_HEADPHONE;
              codec_init.Frequency    = AudioInit->SampleRate;
              codec_init.Resolution   = CS42L51_RESOLUTION_16B; /* Not used */
              codec_init.Volume       = Audio_Out_Ctx[0].Volume;
              if (Audio_Drv->Init(Audio_CompObj, &codec_init) < 0)
              {
                status = BSP_ERROR_COMPONENT_FAILURE;
              }
              else
              {
                /* Update audio in context state */
                Audio_In_Ctx[Instance].State = AUDIO_IN_STATE_STOP;
              }
            }
          }
        }
      }
    }
    else /* (Instance == 1U) */
    {
      /* Fill audio in context structure */
      Audio_In_Ctx[Instance].Device         = AudioInit->Device;
      Audio_In_Ctx[Instance].SampleRate     = AudioInit->SampleRate;
      Audio_In_Ctx[Instance].BitsPerSample  = AudioInit->BitsPerSample;
      Audio_In_Ctx[Instance].ChannelsNbr    = AudioInit->ChannelsNbr;
      Audio_In_Ctx[Instance].Volume         = AudioInit->Volume;

      /* Set MDF instance */
      haudio_in_mdf_filter.Instance  = (MDF_Filter_TypeDef *)ADF1_Filter0;

      /* Configure ADF clock according to the requested audio frequency */
      if (MX_ADF1_ClockConfig(&haudio_in_mdf_filter, AudioInit->SampleRate) != HAL_OK)
      {
        status = BSP_ERROR_CLOCK_FAILURE;
      }
      else
      {
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 0)
        if ((Audio_In_Ctx[Instance].Device & AUDIO_IN_DEVICE_DIGITAL_MIC) == AUDIO_IN_DEVICE_DIGITAL_MIC)
        {
          MDF_BlockMspInit(&haudio_in_mdf_filter);
        }
#else
        /* Register the MDF MSP Callbacks */
        if (AudioIn_IsMspCbValid[Instance] == 0U)
        {
          if (BSP_AUDIO_IN_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
          {
            status = BSP_ERROR_PERIPH_FAILURE;
          }
        }
#endif /* (USE_HAL_MDF_REGISTER_CALLBACKS == 0) */
        if (status == BSP_ERROR_NONE)
        {
          /* Prepare MDF peripheral initialization */
          MX_ADF_InitTypeDef mxAdfInit;
          if ((Audio_In_Ctx[Instance].Device & AUDIO_IN_DEVICE_DIGITAL_MIC) == AUDIO_IN_DEVICE_DIGITAL_MIC)
          {
            if (MX_ADF1_Init(&haudio_in_mdf_filter, &mxAdfInit) != HAL_OK)
            {
              status = BSP_ERROR_PERIPH_FAILURE;
            }

#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
            if (status == BSP_ERROR_NONE)
            {
              /* Register MDF filter TC, HT and Error callbacks */
              if (HAL_MDF_RegisterCallback(&haudio_in_mdf_filter, HAL_MDF_ACQ_COMPLETE_CB_ID,
                                           MDF_AcquisitionCpltCallback) != HAL_OK)
              {
                status = BSP_ERROR_PERIPH_FAILURE;
              }
              else if (HAL_MDF_RegisterCallback(&haudio_in_mdf_filter, HAL_MDF_ACQ_HALFCOMPLETE_CB_ID,
                                                MDF_AcquisitionHalfCpltCallback) != HAL_OK)
              {
                status = BSP_ERROR_PERIPH_FAILURE;
              }
              else
              {
                if (HAL_MDF_RegisterCallback(&haudio_in_mdf_filter, HAL_MDF_ERROR_CB_ID, MDF_ErrorCallback) != HAL_OK)
                {
                  status = BSP_ERROR_PERIPH_FAILURE;
                }
              }
            }
#endif /* (USE_HAL_MDF_REGISTER_CALLBACKS == 1) */
          }

          if (status == BSP_ERROR_NONE)
          {
            /* Initialise transfer control flag */
            Audio_DmaDigMicRecHalfBuffCplt = 0;
            Audio_DmaDigMicRecBuffCplt     = 0;

