STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U575I-EV/stm32u575i_eval_audio.c
  /* DMA linked list init */
  if (HAL_DMAEx_List_Init(&haudio_mdf) != HAL_OK)
  {
    BSP_AUDIO_IN_Error_CallBack(1);
  }

  /* Link queue to DMA channel */
  if (HAL_DMAEx_List_LinkQ(&haudio_mdf, &MdfQueue) != HAL_OK)
  {
    BSP_AUDIO_IN_Error_CallBack(1);
  }

  __HAL_LINKDMA(hmdf, hdma, haudio_mdf);

  HAL_NVIC_SetPriority(GPDMA1_Channel6_IRQn, BSP_AUDIO_IN_IT_PRIORITY, 0);
  HAL_NVIC_EnableIRQ(GPDMA1_Channel6_IRQn);
}

/**
  * @brief  DeInitialize MDF filter MSP.
  * @param  hmdf MDF filter handle.
  * @retval None.
  */
static void MDF_BlockMspDeInit(const MDF_HandleTypeDef *hmdf)
{
  /* De-initialize ADF1_CKOUT, ADF1_DATIN1 pins */
  HAL_GPIO_DeInit(AUDIO_ADF1_CCK0_GPIO_PORT, AUDIO_ADF1_CCK0_GPIO_PIN);
  HAL_GPIO_DeInit(AUDIO_ADF1_SDIN0_GPIO_PORT, AUDIO_ADF1_SDIN0_GPIO_PIN);

  if (hmdf->Instance == ADF1_Filter0)
  {
    /* Disable ADF1 clock */
    AUDIO_ADF1_CLK_DISABLE();

    /* Disable DMA  Channel IRQ */
    HAL_NVIC_DisableIRQ(GPDMA1_Channel6_IRQn);

    /* Reset the DMA Channel configuration*/
    if (HAL_DMAEx_List_DeInit(&haudio_mdf) != HAL_OK)
    {
      BSP_AUDIO_IN_Error_CallBack(1);
    }

    /* Reset MdfQueue */
    if (HAL_DMAEx_List_ResetQ(&MdfQueue) != HAL_OK)
    {
      BSP_AUDIO_IN_Error_CallBack(1);
    }
  }
}

#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
/**
  * @brief  MDF filter regular conversion complete callback.
  * @param  hadf_filter ADF filter handle.
  * @retval None.
  */
static void MDF_AcquisitionCpltCallback(MDF_HandleTypeDef *hadf_filter)
{
  /* Invoke 'TransferCompete' callback function */
  if (hadf_filter == &haudio_in_mdf_filter)
  {
    Audio_DmaDigMicRecBuffCplt = 1;
  }

  if ((Audio_DmaDigMicRecBuffCplt != 0U) && (Audio_In_Ctx[1].Device == AUDIO_IN_DEVICE_DIGITAL_MIC))
  {
    BSP_AUDIO_IN_TransferComplete_CallBack(1);
    Audio_DmaDigMicRecBuffCplt = 0;
  }
}

/**
  * @brief  MDF filter regular conversion half complete callback.
  * @param  hadf_filter ADF filter handle.
  * @retval None.
  */
static void MDF_AcquisitionHalfCpltCallback(MDF_HandleTypeDef *hadf_filter)
{
  /* Invoke the 'HalfTransfer' callback function */
  if (hadf_filter == &haudio_in_mdf_filter)
  {
    Audio_DmaDigMicRecHalfBuffCplt = 1;
  }

  if ((Audio_DmaDigMicRecHalfBuffCplt != 0U) && (Audio_In_Ctx[1].Device == AUDIO_IN_DEVICE_DIGITAL_MIC))
  {
    BSP_AUDIO_IN_HalfTransfer_CallBack(1);
    Audio_DmaDigMicRecHalfBuffCplt = 0;
  }
}

/**
  * @brief  MDF filter error callback.
  * @param  hadf_filter ADF filter handle.
  * @retval None.
  */
static void MDF_ErrorCallback(MDF_HandleTypeDef *hadf_filter)
{
  UNUSED(hadf_filter);

  BSP_AUDIO_IN_Error_CallBack(1);
}
#else /* (USE_HAL_MDF_REGISTER_CALLBACKS == 1) */
/**
  * @brief  MDF filter regular conversion complete callback.
  * @param  hadf_filter ADF filter handle.
  * @retval None.
  */
void HAL_MDF_AcqCpltCallback(MDF_HandleTypeDef *hadf_filter)
{
  /* Invoke 'TransferCompete' callback function */
  if (hadf_filter == &haudio_in_mdf_filter)
  {
    Audio_DmaDigMicRecBuffCplt = 1;
  }

  if ((Audio_DmaDigMicRecBuffCplt != 0U) && (Audio_In_Ctx[1].Device == AUDIO_IN_DEVICE_DIGITAL_MIC))
  {
    BSP_AUDIO_IN_TransferComplete_CallBack(1);
    Audio_DmaDigMicRecBuffCplt = 0;
  }
}

/**
  * @brief  MDF filter regular conversion half complete callback.
  * @param  hadf_filter ADF filter handle.
  * @retval None.
  */
void HAL_MDF_AcqHalfCpltCallback(MDF_HandleTypeDef *hadf_filter)
{
  /* Invoke the 'HalfTransfer' callback function */
  if (hadf_filter == &haudio_in_mdf_filter)
  {
    Audio_DmaDigMicRecHalfBuffCplt = 1;
  }

  if ((Audio_DmaDigMicRecHalfBuffCplt != 0U) && (Audio_In_Ctx[1].Device == AUDIO_IN_DEVICE_DIGITAL_MIC))
  {
    BSP_AUDIO_IN_HalfTransfer_CallBack(1);
    Audio_DmaDigMicRecHalfBuffCplt = 0;
  }
}

/**
  * @brief  MDF filter error callback.
  * @param  hadf_filter ADF filter handle.
  * @retval None.
  */
void HAL_MDF_ErrorCallback(MDF_HandleTypeDef *hadf_filter)
{
  UNUSED(hadf_filter);

  BSP_AUDIO_IN_Error_CallBack(1);
}
#endif /* (USE_HAL_MDF_REGISTER_CALLBACKS == 1) */

/**
  * @brief  ADF1 clock Config.
  * @param  hAdfBlock ADF block handle.
  * @param  SampleRate Audio sample rate used to record the audio stream.
  * @retval HAL status.
  */
__weak HAL_StatusTypeDef MX_ADF1_ClockConfig(const MDF_HandleTypeDef *hAdfBlock, uint32_t SampleRate)
{
  HAL_StatusTypeDef status = HAL_OK;
  RCC_PeriphCLKInitTypeDef RCC_ExCLKInitStruct;

  /* Prevent unused argument(s) compilation warning */
  UNUSED(hAdfBlock);
  UNUSED(SampleRate);

  /* ADF Clock configuration:
  PLL3_VCO Input = MSI_4Mhz/PLL3M = 4 Mhz
  PLL3_VCO Output = PLL3_VCO Input * PLL3N = 320 Mhz
  ADF_CLK_x = PLL3_VCO Output/PLL3Q = 320/28 = 11.428 Mhz */
  RCC_ExCLKInitStruct.PLL3.PLL3Source = RCC_PLLSOURCE_MSI;
  RCC_ExCLKInitStruct.PLL3.PLL3M = 1;
  RCC_ExCLKInitStruct.PLL3.PLL3N = 80;
  RCC_ExCLKInitStruct.PLL3.PLL3P = 28;
  RCC_ExCLKInitStruct.PLL3.PLL3Q = 28;
  RCC_ExCLKInitStruct.PLL3.PLL3R = 2;
  RCC_ExCLKInitStruct.PLL3.PLL3RGE = 0;
  RCC_ExCLKInitStruct.PLL3.PLL3FRACN = 0;
  RCC_ExCLKInitStruct.PLL3.PLL3ClockOut = RCC_PLL3_DIVQ;
  RCC_ExCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_ADF1;
  RCC_ExCLKInitStruct.Adf1ClockSelection = RCC_ADF1CLKSOURCE_PLL3;

  if (HAL_RCCEx_PeriphCLKConfig(&RCC_ExCLKInitStruct) != HAL_OK)
  {
    status = HAL_ERROR;
  }

  return status;
}

/**
  * @brief  Initialize ADF1.
  * @param  hAdfBlock ADF channel handle.
  * @param  MXInit ADF configuration structure.
  * @retval HAL_status.
  */
__weak HAL_StatusTypeDef MX_ADF1_Init(MDF_HandleTypeDef *hAdfBlock, MX_ADF_InitTypeDef *MXInit)
{
  HAL_StatusTypeDef status = HAL_OK;

  UNUSED(MXInit);

  /*  Initialize  MDF */
  hAdfBlock->Init.CommonParam.InterleavedFilters     = 0U;
  hAdfBlock->Init.CommonParam.ProcClockDivider       = 1U;
  hAdfBlock->Init.CommonParam.OutputClock.Activation = ENABLE;
  hAdfBlock->Init.CommonParam.OutputClock.Pins       = MDF_OUTPUT_CLOCK_0;
  hAdfBlock->Init.CommonParam.OutputClock.Divider    = 4U; /* ADF_CCK = 11.428MHz/4 = 2,856 MHz */
  hAdfBlock->Init.CommonParam.OutputClock.Trigger.Activation = DISABLE;
  hAdfBlock->Init.CommonParam.OutputClock.Trigger.Source     = MDF_CLOCK_TRIG_TRGO;
  hAdfBlock->Init.CommonParam.OutputClock.Trigger.Edge       = MDF_CLOCK_TRIG_RISING_EDGE;

  hAdfBlock->Init.SerialInterface.Activation         = ENABLE;
  hAdfBlock->Init.SerialInterface.Mode               = MDF_SITF_NORMAL_SPI_MODE;
  hAdfBlock->Init.SerialInterface.ClockSource        = MDF_SITF_CCK0_SOURCE;
  hAdfBlock->Init.SerialInterface.Threshold          = 31U;

  hAdfBlock->Init.FilterBistream                     = MDF_BITSTREAM5_RISING;

  if (HAL_OK != HAL_MDF_Init(hAdfBlock))
  {
    status = HAL_ERROR;
  }

